ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_DMAXBAR_CONTROLSS_502D6000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_DMAXBAR0_GSEL" acronym="CONTROLSS_DMAXBAR0_GSEL" offset="256" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR0_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G0" acronym="CONTROLSS_DMAXBAR0_G0" offset="260" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G1" acronym="CONTROLSS_DMAXBAR0_G1" offset="264" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G2" acronym="CONTROLSS_DMAXBAR0_G2" offset="268" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G3" acronym="CONTROLSS_DMAXBAR0_G3" offset="272" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G4" acronym="CONTROLSS_DMAXBAR0_G4" offset="276" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR0_G5" acronym="CONTROLSS_DMAXBAR0_G5" offset="280" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR0_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_GSEL" acronym="CONTROLSS_DMAXBAR1_GSEL" offset="320" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR1_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G0" acronym="CONTROLSS_DMAXBAR1_G0" offset="324" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G1" acronym="CONTROLSS_DMAXBAR1_G1" offset="328" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G2" acronym="CONTROLSS_DMAXBAR1_G2" offset="332" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G3" acronym="CONTROLSS_DMAXBAR1_G3" offset="336" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G4" acronym="CONTROLSS_DMAXBAR1_G4" offset="340" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR1_G5" acronym="CONTROLSS_DMAXBAR1_G5" offset="344" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR1_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_GSEL" acronym="CONTROLSS_DMAXBAR2_GSEL" offset="384" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR2_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G0" acronym="CONTROLSS_DMAXBAR2_G0" offset="388" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G1" acronym="CONTROLSS_DMAXBAR2_G1" offset="392" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G2" acronym="CONTROLSS_DMAXBAR2_G2" offset="396" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G3" acronym="CONTROLSS_DMAXBAR2_G3" offset="400" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G4" acronym="CONTROLSS_DMAXBAR2_G4" offset="404" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR2_G5" acronym="CONTROLSS_DMAXBAR2_G5" offset="408" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR2_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_GSEL" acronym="CONTROLSS_DMAXBAR3_GSEL" offset="448" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR3_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G0" acronym="CONTROLSS_DMAXBAR3_G0" offset="452" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G1" acronym="CONTROLSS_DMAXBAR3_G1" offset="456" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G2" acronym="CONTROLSS_DMAXBAR3_G2" offset="460" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G3" acronym="CONTROLSS_DMAXBAR3_G3" offset="464" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G4" acronym="CONTROLSS_DMAXBAR3_G4" offset="468" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR3_G5" acronym="CONTROLSS_DMAXBAR3_G5" offset="472" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR3_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_GSEL" acronym="CONTROLSS_DMAXBAR4_GSEL" offset="512" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR4_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G0" acronym="CONTROLSS_DMAXBAR4_G0" offset="516" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G1" acronym="CONTROLSS_DMAXBAR4_G1" offset="520" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G2" acronym="CONTROLSS_DMAXBAR4_G2" offset="524" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G3" acronym="CONTROLSS_DMAXBAR4_G3" offset="528" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G4" acronym="CONTROLSS_DMAXBAR4_G4" offset="532" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR4_G5" acronym="CONTROLSS_DMAXBAR4_G5" offset="536" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR4_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_GSEL" acronym="CONTROLSS_DMAXBAR5_GSEL" offset="576" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR5_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G0" acronym="CONTROLSS_DMAXBAR5_G0" offset="580" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G1" acronym="CONTROLSS_DMAXBAR5_G1" offset="584" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G2" acronym="CONTROLSS_DMAXBAR5_G2" offset="588" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G3" acronym="CONTROLSS_DMAXBAR5_G3" offset="592" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G4" acronym="CONTROLSS_DMAXBAR5_G4" offset="596" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR5_G5" acronym="CONTROLSS_DMAXBAR5_G5" offset="600" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR5_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_GSEL" acronym="CONTROLSS_DMAXBAR6_GSEL" offset="640" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR6_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G0" acronym="CONTROLSS_DMAXBAR6_G0" offset="644" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G1" acronym="CONTROLSS_DMAXBAR6_G1" offset="648" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G2" acronym="CONTROLSS_DMAXBAR6_G2" offset="652" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G3" acronym="CONTROLSS_DMAXBAR6_G3" offset="656" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G4" acronym="CONTROLSS_DMAXBAR6_G4" offset="660" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR6_G5" acronym="CONTROLSS_DMAXBAR6_G5" offset="664" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR6_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_GSEL" acronym="CONTROLSS_DMAXBAR7_GSEL" offset="704" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR7_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G0" acronym="CONTROLSS_DMAXBAR7_G0" offset="708" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR7_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G1" acronym="CONTROLSS_DMAXBAR7_G1" offset="712" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR7_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G2" acronym="CONTROLSS_DMAXBAR7_G2" offset="716" width="32" description="Event Select within corresponding group.">
