ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_DMAXBAR_CONTROLSS_502D6000h.xml
		<bitfield id="DMAXBAR7_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G3" acronym="CONTROLSS_DMAXBAR7_G3" offset="720" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR7_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G4" acronym="CONTROLSS_DMAXBAR7_G4" offset="724" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR7_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR7_G5" acronym="CONTROLSS_DMAXBAR7_G5" offset="728" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR7_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_GSEL" acronym="CONTROLSS_DMAXBAR8_GSEL" offset="768" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR8_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G0" acronym="CONTROLSS_DMAXBAR8_G0" offset="772" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G1" acronym="CONTROLSS_DMAXBAR8_G1" offset="776" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G2" acronym="CONTROLSS_DMAXBAR8_G2" offset="780" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G3" acronym="CONTROLSS_DMAXBAR8_G3" offset="784" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G4" acronym="CONTROLSS_DMAXBAR8_G4" offset="788" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR8_G5" acronym="CONTROLSS_DMAXBAR8_G5" offset="792" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR8_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_GSEL" acronym="CONTROLSS_DMAXBAR9_GSEL" offset="832" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR9_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G0" acronym="CONTROLSS_DMAXBAR9_G0" offset="836" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G1" acronym="CONTROLSS_DMAXBAR9_G1" offset="840" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G2" acronym="CONTROLSS_DMAXBAR9_G2" offset="844" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G3" acronym="CONTROLSS_DMAXBAR9_G3" offset="848" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G4" acronym="CONTROLSS_DMAXBAR9_G4" offset="852" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR9_G5" acronym="CONTROLSS_DMAXBAR9_G5" offset="856" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR9_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_GSEL" acronym="CONTROLSS_DMAXBAR10_GSEL" offset="896" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR10_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G0" acronym="CONTROLSS_DMAXBAR10_G0" offset="900" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G1" acronym="CONTROLSS_DMAXBAR10_G1" offset="904" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G2" acronym="CONTROLSS_DMAXBAR10_G2" offset="908" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G3" acronym="CONTROLSS_DMAXBAR10_G3" offset="912" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G4" acronym="CONTROLSS_DMAXBAR10_G4" offset="916" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR10_G5" acronym="CONTROLSS_DMAXBAR10_G5" offset="920" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR10_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_GSEL" acronym="CONTROLSS_DMAXBAR11_GSEL" offset="960" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR11_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G0" acronym="CONTROLSS_DMAXBAR11_G0" offset="964" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G1" acronym="CONTROLSS_DMAXBAR11_G1" offset="968" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G2" acronym="CONTROLSS_DMAXBAR11_G2" offset="972" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G3" acronym="CONTROLSS_DMAXBAR11_G3" offset="976" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G4" acronym="CONTROLSS_DMAXBAR11_G4" offset="980" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR11_G5" acronym="CONTROLSS_DMAXBAR11_G5" offset="984" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR11_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_GSEL" acronym="CONTROLSS_DMAXBAR12_GSEL" offset="1024" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR12_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G0" acronym="CONTROLSS_DMAXBAR12_G0" offset="1028" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G1" acronym="CONTROLSS_DMAXBAR12_G1" offset="1032" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G2" acronym="CONTROLSS_DMAXBAR12_G2" offset="1036" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G3" acronym="CONTROLSS_DMAXBAR12_G3" offset="1040" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G4" acronym="CONTROLSS_DMAXBAR12_G4" offset="1044" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR12_G5" acronym="CONTROLSS_DMAXBAR12_G5" offset="1048" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR12_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_GSEL" acronym="CONTROLSS_DMAXBAR13_GSEL" offset="1088" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR13_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G0" acronym="CONTROLSS_DMAXBAR13_G0" offset="1092" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G1" acronym="CONTROLSS_DMAXBAR13_G1" offset="1096" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G2" acronym="CONTROLSS_DMAXBAR13_G2" offset="1100" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G3" acronym="CONTROLSS_DMAXBAR13_G3" offset="1104" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G4" acronym="CONTROLSS_DMAXBAR13_G4" offset="1108" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G4_SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding XBAR0:SD0.FILT1.DRINT1:SD0.FILT2.DRINT2:SD0.FILT3.DRINT3:SD0.FILT4.DRINT4:SD1.FILT1.DRINT5:SD1.FILT2.DRINT6:SD1.FILT3.DRINT7:SD1.FILT4.DRINT" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR13_G5" acronym="CONTROLSS_DMAXBAR13_G5" offset="1112" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR13_G5_SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding XBAR0:ECAP0.DMA_INT1:ECAP1.DMA_INT2:ECAP2.DMA_INT3:ECAP3.DMA_INT4:ECAP4.DMA_INT5:ECAP5.DMA_INT6:ECAP6.DMA_INT7:ECAP7.DMA_INT8:ECAP8.DMA_INT9:ECAP9.DMA_INT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_GSEL" acronym="CONTROLSS_DMAXBAR14_GSEL" offset="1152" width="32" description="Group Select register to select between G0-G5.">
		<bitfield id="DMAXBAR14_GSEL_GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0:G0 selected..5:G5 selected" range="2:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_G0" acronym="CONTROLSS_DMAXBAR14_G0" offset="1156" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR14_G0_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCA to corresponding XBAR1:PWMx.SOCA is selected0:PWMx.SOCA is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_G1" acronym="CONTROLSS_DMAXBAR14_G1" offset="1160" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR14_G1_SEL" width="5" begin="4" end="0" resetval="0x0" description="EPWM SOCB to corresponding XBAR1:PWMx.SOCB is selected0:PWMx.SOCB is de-selected" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_G2" acronym="CONTROLSS_DMAXBAR14_G2" offset="1164" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR14_G2_SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding XBAR0:ADC0.INT11:ADC0.INT22:ADC0.INT33:ADC0.INT44:ADC0.EVTINT5:ADC1.INT16:ADC1.INT27:ADC1.INT38:ADC1.INT49:ADC1.EVTINT10:ADC2.INT111:ADC2.INT212:ADC2.INT313:ADC2.INT414:ADC2.EVTINT15:ADC3.INT116:ADC3.INT217:ADC3.INT318:ADC3.INT419:ADC3.EVTINT20:ADC4.INT121:ADC4.INT222:ADC4.INT323:ADC4.INT424:ADC4.EVTINT" range="4:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_G3" acronym="CONTROLSS_DMAXBAR14_G3" offset="1168" width="32" description="Event Select within corresponding group.">
		<bitfield id="DMAXBAR14_G3_SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding XBAR0:FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12:FSIRX0_DMATRIG23:FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15:FSIRX1_DMATRIG26:FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18:FSIRX2_DMATRIG29:FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111:FSIRX3_DMATRIG212:FSITX0.TX_DMA_EVT13:FSITX1.TX_DMA_EVT14:FSITX2.TX_DMA_EVT15:FSITX3.TX_DMA_EVT" range="3:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_DMAXBAR14_G4" acronym="CONTROLSS_DMAXBAR14_G4" offset="1172" width="32" description="Event Select within corresponding group.">
